type_1_money = """가격 중시 가성비형
가성비 중시 유형이군요! 이 유형은 집을 구할 때 많은 노력을 기울이는 편입니다. 여러 매물을 놓고 이성적으로 장단점을 비교하다보니 자연스레 가성비 좋고 저렴한 매물을 찾는 데에 주력하는 편이죠. 심지어는 향후 가치 상승 가능성, 관리비와 같은 유지 비용같은 사소한 부분까지 놓치지 않는 편입니다. 내 맘에 드는 집보다는 가성비 좋은 집을 내 취향에 맞게 꾸미거나 그 자체로 집을 좋아하는 유형입니다. 

보통 평소에 꼼꼼하고 계획적인 사회초년생 혹은 대학생들이 저예산으로 집을 구해야 할 때 자주 보이는 유형입니다.
"""
type_2_option = """세탁기, 에어컨, 옷장 등의 옵션을 선호하는 옵션 중시형
옵션 중시형은 집을 계약하면서 같이 오는 옵션에 대한 중요도를 높게 보는 유형이에요. 새로운 집에 이사한 이후에 발생하는 필수적인 가구 등에 대한 추가 비용을 최대한 줄이고 싶어하는 유형이죠. 집에 있는 가구로 인테리어를 꾸미고 싶어하기 보다는 그 에너지와 비용으로 다른 일에 몰두하고 싶어하는 편이에요. 주로 에어컨, 세탁기, 냉장고, 옷장 등에 대해 살피며, 세세하게는 옵션 가구의 크기와 모양까지도 챙겨가고 싶어하는 분들이 많아요. 심지어는 건조기, 식기세척기, 비데 등 생활에 필수적이진 않지만 삶의 만족도를 올려줄 수 있는 옵션들을 선호하는 분들도 계신답니다!

보통 성격이 무던하며 꼼꼼한 분들이 이 유형에 해당하는 경우가 많아요. 실용적인 면을 중요하게 생각하고 과거나 미래에 대해 걱정하기 보다는 현재에 충실하고자 하는 편인 분들이 많아요. 
"""
type_3_structure = """집의 구조, 크기, 방향 등을 중요시하는 구조중시형
구조중시형이군요! 이들은 방의 개수와 창의 방향, 공간의 분리 등과 같은 집 내부의 요소에 관심이 많습니다. 방의 배치, 동선, 수납 공간과 같은 효율성을 중요하게 생각하는 경향이 있기 때문에 자취생활 경험이 있거나 독립한지 오래되어 노하우가 쌓인 사람들이 이 유형에 속합니다. 각자의 취향마다 선호하는 집의 구조는 다릅니다. 방의 개수, 집의 크기, 개방감, 환기의 가능성, 채광 등등 각자가 선호하는 요소가 뚜렷하게 존재합니다. 이들은 주로 발품을 팔아 하나하나 집에 방문해보는 것을 선호하기도 하며, 인테리어 역시 중요하게 생각하는 유형입니다. 

이들은 체계적이고 효율적인 사고방식을 가진 사람일 가능성이 높으며 생활에서의 작은 편리함들이 모여 삶의 질을 결정한다고 믿습니다.
"""
type_4_transport = """교통편이나 회사 근처를 선호하는 교통 중시형
교통 중시형이시군요! 교통 중시형은 출퇴근의 용이함과 대중교통 접근성을 중요시하는 사람들을 의미합니다. 이들은 통근 시간을 최소화하고자 지하철역, 버스 정류장과 가까운 곳을 선호하며, 종종 큰 도로나 고속도로 접근성 또한 고려합니다. 매일의 출퇴근이 편리해야 직장 생활과 사회생활에서 발생하는 스트레스를 줄일 수 있다고 믿는 유형으로, 이동이 잦은 직업을 가진 사람들 사이에서 특히 인기가 높습니다.

이들은 대중교통 접근성과 통근 편의를 최우선으로 여기며, 이를 통해 일상의 효율성을 높이고 직장 생활에서의 스트레스를 줄이는 것을 중요하게 생각합니다.
"""
type_5_nature = """공원, 강, 하천, 산 주변에 있기를 원하는 자연인 유형
자연을 좋아하는 자연인 유형이시군요! 자연과 가까운 환경에서의 삶을 선호하는 자연인 유형은 일상 속에서도 자연을 누릴 수 있는 지역에 거주하기를 원합니다. 공원, 강변, 산책로가 인접한 곳이 이상적인 거주지입니다. 이 유형은 심신의 건강과 휴식을 중시하며, 집 근처에서 쉽게 접근할 수 있는 자연 환경에서의 여가 활동을 중요한 생활의 일부로 여깁니다. 자연인 유형은 도심의 번잡함보다는 평화롭고 고요한 환경에서 삶의 질을 높이고자 합니다.

이들은 자연과의 깊은 연결을 통해 심신의 건강을 유지하고 평화로운 생활 환경에서 삶의 질을 높이기를 추구합니다.
"""
type_6_emotion = """감성있는 동네(성수, 망원, 해방촌, 홍대 등)를 선호하는 유형
감성이 있는 동네를 선호하시는군요! 특색 있는 지역 문화와 예술적 환경을 중시하는 이 유형은 성수, 망원, 해방촌, 홍대와 같은 동네에서의 거주를 선호합니다. 이들 지역은 독특한 카페, 갤러리, 라이브 음악 공연장과 같은 문화적 요소가 풍부하여 젊은 예술가와 창작자들에게 매력적입니다. 감성 유형은 일상에서 예술과 문화를 즐기며, 자신만의 취향과 스타일을 반영할 수 있는 주거 공간에서 영감을 받고자 합니다. 주변 환경이 자신의 생활 방식과 취미 활동을 지원하고, 동시에 창의적인 영감을 제공하는 것을 중요하게 여깁니다.

이들은 문화적 풍부함과 예술적 환경에서 일상적 영감과 개인적 취향을 반영할 수 있는 생활 공간을 중시합니다.
"""
type_7_business = """사당, 여의도, 시청, 용산, 강남, 분당, 판교 등 회사가 많은 지역을 선호하는 직장인 유형
직장인 유형이군요! 이 유형은 주로 직장인들이며, 출퇴근의 편리함과 직장 접근성을 가장 중요하게 생각합니다. 사당, 여의도, 시청, 용산, 강남, 분당, 판교와 같은 주요 비즈니스 허브 지역을 선호하며, 교통이 편리하고 직장과의 거리가 가까워 시간 절약과 효율적인 생활이 가능한 곳을 찾습니다. 이러한 지역들은 비즈니스 관련 시설이 잘 갖추어져 있어 업무와 생활의 균형을 맞추기에 유리합니다.

이들은 회사 근처 주거지를 선호하여 출퇴근 시간을 최소화하고 직장 근처의 인프라를 최대한 활용하려는 경향이 있습니다. 또한, 직장과의 거리뿐만 아니라 주변의 편의시설, 교통 환경, 안전성 등도 중요하게 고려합니다.
"""
type_8_student = """대학 주변을 원하는 대학생 유형
대학생 유형이군요! 이 유형은 주로 대학생들이며, 대학 캠퍼스와 가까운 지역에 주거지를 찾는 것을 선호합니다. 대학 주변 지역은 학업과 관련된 편의시설과 학생 친화적인 환경이 잘 갖추어져 있어 학업과 생활의 편리함을 제공합니다. 주로 자취를 하거나 독립적인 생활을 시작하는 대학생들이 이 유형에 속합니다. 

이들은 학내 시설과 가까운 주거지에서 학업과 일상을 원활히 병행하고 싶어하며, 경제적인 부담을 줄일 수 있는 저렴한 월세나 오피스텔을 찾습니다. 또한, 친구들과의 모임이나 대외 활동에 쉽게 참여할 수 있는 교통이 편리한 지역을 선호하며  대학 주변의 카페, 도서관, 식당 등 학생들에게 필요한 다양한 시설들이 가까이 있는 것도 중요하게 생각합니다.
"""